tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/science"
cask "adoptopenjdk"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# The Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Password generator
brew "pwgen"
# Messaging broker
brew "rabbitmq"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
cask "adoptopenjdk8"
cask "adoptopenjdk13"
cask "amethyst"
cask "android-studio"
cask "docker"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "libreoffice"
cask "macdown"
cask "postman"
cask "robomongo"
cask "skype"
cask "slack"
cask "sourcetree"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
